app/Models/AuthModel.php

	public function adminLogin(string $username, string $password)
	{
		$admin = $this->db->table('admin')
			->where('user', $username)
			->get()
			->getRow();
---
SELECT *
FROM `admin`
WHERE `user` = 'alejandro'

	public function updateLastSession(int $adminId)
	{
		$this->db->table('admin')
			->where('id', $adminId)
			->update(['last_session' => date('Y-m-d H:i:s')]);
---
UPDATE `admin` SET `last_session` = '2026-02-14 09:59:03'
WHERE `id` = 1