app/Models/MainModel.php

SELECT *
FROM `products`
---
	public function getProducts()
	{
		return  $this->db->table('products')
			->get()->getResult();

SELECT *
FROM `categories`
---
	public function getCategories()
	{
		return  $this->db->table('categories')
			->get()->getResult();

SELECT *
FROM `orders`
---
	public function getOrders()
	{
		$orders = $this->db->table('orders')->get()->getResult();

SELECT `id`, `name`
FROM `products`
WHERE `id` IN (1,2)
---
			}

			// Consultar nombres de productos
			$items = $this->db->table('products')
				->select('id, name')
				->whereIn('id', $ids)
				->get()
				->getResultArray();

SELECT *
FROM `admin`
---
	public function getAdmins()
	{
		return  $this->db->table('admin')
			->get()->getResult();