app/Models/MainModel.php

	public function getPizzas()
	{
		return  $this->db->table('pizzas')
			->get()->getResult();
---
SELECT *
FROM `pizzas`

			}

			// Consultar nombres de productos
			$items = $this->db->table('pizzas')
				->select('id, name')
				->whereIn('id', $ids)
				->get()
				->getResultArray();
---
SELECT `id`, `name`
FROM `pizzas`
WHERE `id` IN (7)